---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GeometryInstance..::..GetSymbolGeometry Method
GeometryInstance Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetSymbolGeometry()()()() | Computes the geometric representation of the symbol which generates this instance. |
|  | GetSymbolGeometry(Transform) | Computes a transformation of the geometric representation of the symbol which generates this instance. |

# See Also

GeometryInstance Class

GeometryInstance Members

Autodesk.Revit.DB Namespace